https://towardsdatascience.com/getting-more-value-from-the-pandas-count-3e45a62c7077

In [6]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    "Person": ["John", "Tom", "Lewis", "John", "Myla"],
    "Age": [24., np.nan, 21., 33, 26],
    "Single": [False, True, True, None, np.datetime64('NaT')],
    "Department": ["Product", "IT", "IT", "IT", "Product"]
})
print(df)
df.count()

  Person   Age Single Department
0   John  24.0  False    Product
1    Tom   NaN   True         IT
2  Lewis  21.0   True         IT
3   John  33.0   None         IT
4   Myla  26.0    NaT    Product

Person        5
Age           4
Single        3
Department    5
dtype: int64

In [5]:
df.count(axis = 1)

0    4
1    3
2    4
3    3
4    3
dtype: int64

In [7]:
df.count(axis = 'columns')

0    4
1    3
2    4
3    3
4    3
dtype: int64

In [9]:
df = pd.read_csv(
    'titanic_train.csv', 
    index_col=['Sex', 'Survived']
)
df.head()

                 PassengerId  Pclass  \
Sex    Survived
male   0                   1       3
female 1                   2       1
       1                   3       3
       1                   4       1
male   0                   5       3

                                                              Name   Age  \
Sex    Survived
male   0                                   Braund, Mr. Owen Harris  22.0
female 1         Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
       1                                    Heikkinen, Miss. Laina  26.0
       1              Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
male   0                                  Allen, Mr. William Henry  35.0

                 SibSp  Parch            Ticket     Fare Cabin Embarked
Sex    Survived
male   0             1      0         A/5 21171   7.2500   NaN        S
female 1             1      0          PC 17599  71.2833   C85        C
       1             0      0  STON/O2. 3101282   7.9250   NaN        S
       1             1      0            113803  53.1000  C123        S
male   0             0      0            373450   8.0500   NaN        S

In [10]:
df.count(level='Sex')

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,
female,314,314,314,261,314,314,314,314,97,312
male,577,577,577,453,577,577,577,577,107,577

In [11]:
df.count(level='Survived')

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Survived,,,,,,,,,,
0,549,549,549,424,549,549,549,549,68,549
1,342,342,342,290,342,342,342,342,136,340

In [12]:
df.count(numeric_only=True)

PassengerId    891
Pclass         891
Age            714
SibSp          891
Parch          891
Fare           891
dtype: int64

In [14]:
df = pd.DataFrame({
    "Person": ["John", "Tom", "Lewis", "John", "Myla"],
    "Age": [24., np.nan, 21., 33, 26],
    "Single": [False, True, True, None, np.datetime64('NaT')],
    "Department": ["Product", "IT", "IT", "IT", "Product"]
})
print(df)

  Person   Age Single Department
0   John  24.0  False    Product
1    Tom   NaN   True         IT
2  Lewis  21.0   True         IT
3   John  33.0   None         IT
4   Myla  26.0    NaT    Product

In [15]:
df.groupby('Department')['Single'].count()

Department
IT         2
Product    1
Name: Single, dtype: int64

In [16]:
df.groupby('Department')['Single'].agg('count')

Department
IT         2
Product    1
Name: Single, dtype: int64

In [17]:
df.groupby('Department').count()

            Person  Age  Single
Department
IT               3    2       2
Product          2    2       1

In [18]:
df.groupby('Department').agg('count')

            Person  Age  Single
Department
IT               3    2       2
Product          2    2       1

In [19]:
df.groupby('Department')['Single'].count()

Department
IT         2
Product    1
Name: Single, dtype: int64

In [22]:
temp_df = df.groupby('Department')['Single'].count().rename('department_total_count').to_frame()
print(temp_df)

            department_total_count
Department
IT                               2
Product                          1

In [23]:
temp_df.reset_index()

  Department  department_total_count
0         IT                       2
1    Product                       1

In [25]:
df_new = pd.merge(df, temp_df, on='Department', how='left')
print(df_new)

  Person   Age Single Department  department_total_count
0   John  24.0  False    Product                       1
1    Tom   NaN   True         IT                       2
2  Lewis  21.0   True         IT                       2
3   John  33.0   None         IT                       2
4   Myla  26.0    NaT    Product                       1

In [26]:
x=df.groupby('Department')['Single'].transform('count')
print(x)

0    1
1    2
2    2
3    2
4    1
Name: Single, dtype: int64

In [31]:
list(df.groupby('Department')['Single'])

[('IT',
  1    True
  2    True
  3    None
  Name: Single, dtype: object),
 ('Product',
  0    False
  4      NaT
  Name: Single, dtype: object)]

In [32]:
df['department_total_single'] = df.groupby('Department')['Single'].transform('count')

In [33]:
print(df)

  Person   Age Single Department  department_total_single
0   John  24.0  False    Product                        1
1    Tom   NaN   True         IT                        2
2  Lewis  21.0   True         IT                        2
3   John  33.0   None         IT                        2
4   Myla  26.0    NaT    Product                        1